app/views/posts/index.html.erb

  <p><%= post.conteudo %></p>
  <p>Tags: <%= raw post.tag_list.map { |t| link_to t, tag_path(t) }.join(', ') %></p>
---
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'comédia')