app/views/posts/show.html.erb

SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."post_id" = ? ORDER BY created_at DESC  [["post_id", 2]]
---
<h3>Comentarios</h3>
<% @post.comentarios.each do |comentario| %>