app/controllers/comentarios_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comentario = @post.comentarios.create(comentario_params)
    #@comentario = @post.comentarios.create(params[:comentarios])
    if @comentario.autor == nil
      @comentario.autor = current_user.name
      @comentario.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comentarios" ("autor", "conteudo", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["autor", "sdafasdf"], ["conteudo", "asdfdsaf"], ["created_at", Mon, 02 Dec 2013 16:14:11 UTC +00:00], ["post_id", 2], ["updated_at", Mon, 02 Dec 2013 16:14:11 UTC +00:00]]
UPDATE "comentarios" SET "autor" = ?, "updated_at" = ? WHERE "comentarios"."id" = 24  [["autor", "frederico"], ["updated_at", Fri, 13 Dec 2013 16:13:12 UTC +00:00]]

  def destroy
    @post = Post.find(params[:post_id])
    @comentario = @post.comentarios.find(params[:id])
    @comentario.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."post_id" = ? AND "comentarios"."id" = ? LIMIT 1  [["post_id", 1], ["id", "1"]]
DELETE FROM "comentarios" WHERE "comentarios"."id" = ?  [["id", 1]]