app/controllers/posts_controller.rb

  def index
    if params[:tag]
      @posts = Post.tagged_with(params[:tag]).paginate(:order => 'created_at DESC', :page => params[:page], :per_page => 5)
---
SELECT "posts".* FROM "posts" JOIN taggings posts_taggings_a46e754 ON posts_taggings_a46e754.taggable_id = posts.id AND posts_taggings_a46e754.taggable_type = 'Post' AND posts_taggings_a46e754.tag_id = 1 ORDER BY created_at DESC LIMIT 2 OFFSET 2
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'comédia')
SELECT COUNT(*) FROM "posts" JOIN taggings posts_taggings_5efcc52 ON posts_taggings_5efcc52.taggable_id = posts.id AND posts_taggings_5efcc52.taggable_type = 'Post' AND posts_taggings_5efcc52.tag_id = 1

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("address", "conteudo", "created_at", "titulo", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", ""], ["conteudo", "jhgfjfghjghfjhgfj"], ["created_at", Fri, 13 Dec 2013 19:47:02 UTC +00:00], ["titulo", "gfdfhjjgdfjfgj"], ["updated_at", Fri, 13 Dec 2013 19:47:02 UTC +00:00]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "posts"."id" = 23  [["address", "Braga"], ["latitude", 41.5454486], ["longitude", -8.426506999999999], ["updated_at", Fri, 13 Dec 2013 19:04:37 UTC +00:00]]